# MirrorFailures Properties

---
The BuiltInFailuresMirrorFailures type exposes the following members.
| Name| Description
---|---|---
| BadMirror|  Can't mirror element into this position.
Top
#### Reference
BuiltInFailuresMirrorFailures Class
Autodesk.Revit.DB Namespace